In [1]:
import numpy as np
import pandas as pd

In [2]:
data = np.array([5,12,34,44,18,19,21,34,38,56])
s = pd.Series(data)

In [3]:
type(s)

pandas.core.series.Series

In [5]:
# s
s[0]

5

In [6]:
s[0:4]

0     5
1    12
2    34
3    44
dtype: int32

In [9]:
ind = ['a','b','c','d','e','f','g','h','i','j']
# s = pd.Series(data, index=list('abcdefghij'))
s = pd.Series(data, index=ind)

In [10]:
s

a     5
b    12
c    34
d    44
e    18
f    19
g    21
h    34
i    38
j    56
dtype: int32

In [11]:
s.head()

a     5
b    12
c    34
d    44
e    18
dtype: int32

In [12]:
s.tail()

f    19
g    21
h    34
i    38
j    56
dtype: int32

In [15]:
data = {
    'names' : ['Sachin','Sehwag','Gambhir','Dhoni','Virat','Yuvraj','Ishant'],
    'score' : [67,45,23,89,110,80,None]
}

In [16]:
df = pd.DataFrame(data)

In [17]:
df

     names  score
0   Sachin   67.0
1   Sehwag   45.0
2  Gambhir   23.0
3    Dhoni   89.0
4    Virat  110.0
5   Yuvraj   80.0
6   Ishant    NaN

In [18]:
df.head()

     names  score
0   Sachin   67.0
1   Sehwag   45.0
2  Gambhir   23.0
3    Dhoni   89.0
4    Virat  110.0

In [22]:
df[df['names'] == 'Sehwag']

    names  score
1  Sehwag   45.0

In [23]:
df[df['score'] > 50]

    names  score
0  Sachin   67.0
3   Dhoni   89.0
4   Virat  110.0
5  Yuvraj   80.0

In [25]:
df = df.dropna()

In [32]:
df.sort_values('score', ascending=False)

     names  score
4    Virat  110.0
3    Dhoni   89.0
5   Yuvraj   80.0
0   Sachin   67.0
1   Sehwag   45.0
2  Gambhir   23.0

In [33]:
df[0:4]

     names  score
0   Sachin   67.0
1   Sehwag   45.0
2  Gambhir   23.0
3    Dhoni   89.0